[
  {
    "id": "agent",
    "term": "Agent",
    "definition": "An AI-powered autonomous workflow that can make decisions and take actions based on context and goals. Agents in AirOps can process complex tasks by breaking them down into steps and using various tools.",
    "category": "Core Concepts",
    "relatedTerms": ["workflow", "action", "tool"],
    "example": "A content research agent that gathers information from multiple sources and synthesizes it into a report."
  },
  {
    "id": "workflow",
    "term": "Workflow",
    "definition": "A sequence of connected steps that automate a process. Workflows in AirOps can include AI actions, data transformations, conditional logic, and integrations with external services.",
    "category": "Workflows & Actions",
    "relatedTerms": ["agent", "action", "trigger"],
    "example": "A lead enrichment workflow that takes a company name and returns detailed firmographic data."
  },
  {
    "id": "action",
    "term": "Action",
    "definition": "A single step within a workflow that performs a specific task. Actions can be AI-powered (like text generation) or utility-based (like data transformation or API calls).",
    "category": "Workflows & Actions",
    "relatedTerms": ["workflow", "tool"],
    "example": "A 'Generate Text' action that creates product descriptions based on input specifications."
  },
  {
    "id": "trigger",
    "term": "Trigger",
    "definition": "An event that initiates a workflow execution. Triggers can be manual (API call, button click) or automated (schedule, webhook, data change).",
    "category": "Workflows & Actions",
    "relatedTerms": ["workflow", "webhook"],
    "example": "A webhook trigger that runs a workflow whenever a new form submission is received."
  },
  {
    "id": "prompt",
    "term": "Prompt",
    "definition": "The input text or instructions given to an AI model to generate a response. In AirOps, prompts can include variables, context, and formatting instructions.",
    "category": "AI & Models",
    "relatedTerms": ["model", "completion", "variable"],
    "example": "Write a professional email to {{contact_name}} about {{product_name}} highlighting its key benefits."
  },
  {
    "id": "model",
    "term": "Model",
    "definition": "The AI language model used to process prompts and generate responses. AirOps supports various models from providers like OpenAI, Anthropic, and others.",
    "category": "AI & Models",
    "relatedTerms": ["prompt", "completion"],
    "example": "Using GPT-4 for complex reasoning tasks or Claude for nuanced content generation."
  },
  {
    "id": "completion",
    "term": "Completion",
    "definition": "The output generated by an AI model in response to a prompt. Completions can be text, structured data, or other formats depending on the model and configuration.",
    "category": "AI & Models",
    "relatedTerms": ["prompt", "model"],
    "example": "The generated product description returned after sending a prompt to the AI model."
  },
  {
    "id": "variable",
    "term": "Variable",
    "definition": "A dynamic placeholder in workflows that stores and passes data between actions. Variables can hold text, numbers, arrays, objects, or other data types.",
    "category": "Data & Variables",
    "relatedTerms": ["input", "output", "context"],
    "example": "{{user.email}} - a variable that contains the current user's email address."
  },
  {
    "id": "input",
    "term": "Input",
    "definition": "Data provided to a workflow or action at the start of execution. Inputs define what information the workflow needs to run.",
    "category": "Data & Variables",
    "relatedTerms": ["variable", "output"],
    "example": "A workflow input schema requiring 'company_name' and 'industry' fields."
  },
  {
    "id": "output",
    "term": "Output",
    "definition": "The result produced by a workflow or action after execution. Outputs can be returned to the caller or passed to subsequent actions.",
    "category": "Data & Variables",
    "relatedTerms": ["variable", "input"],
    "example": "A JSON object containing enriched company data returned at the end of a workflow."
  },
  {
    "id": "context",
    "term": "Context",
    "definition": "Background information provided to AI models to improve response quality. Context can include previous conversation history, relevant documents, or domain-specific knowledge.",
    "category": "AI & Models",
    "relatedTerms": ["prompt", "rag", "knowledge-base"],
    "example": "Including company brand guidelines as context when generating marketing copy."
  },
  {
    "id": "integration",
    "term": "Integration",
    "definition": "A connection between AirOps and an external service or platform. Integrations enable workflows to read from and write to tools like CRMs, databases, and communication platforms.",
    "category": "Integrations",
    "relatedTerms": ["api", "webhook", "connector"],
    "example": "A Salesforce integration that allows workflows to create and update leads."
  },
  {
    "id": "api",
    "term": "API",
    "definition": "Application Programming Interface - a way for different software systems to communicate. AirOps workflows can be triggered via API and can make API calls to external services.",
    "category": "Integrations",
    "relatedTerms": ["integration", "webhook", "endpoint"],
    "example": "Calling the AirOps API to execute a workflow programmatically from your application."
  },
  {
    "id": "webhook",
    "term": "Webhook",
    "definition": "An HTTP callback that sends data to a specified URL when an event occurs. Webhooks can trigger AirOps workflows or receive data from workflow executions.",
    "category": "Integrations",
    "relatedTerms": ["trigger", "api", "integration"],
    "example": "A Stripe webhook that triggers a customer onboarding workflow when a payment succeeds."
  },
  {
    "id": "knowledge-base",
    "term": "Knowledge Base",
    "definition": "A collection of documents, data, or information that AI models can reference when generating responses. Knowledge bases enable domain-specific and up-to-date AI outputs.",
    "category": "AI & Models",
    "relatedTerms": ["rag", "context", "embedding"],
    "example": "A knowledge base containing product documentation that the AI references when answering customer questions."
  },
  {
    "id": "rag",
    "term": "RAG",
    "definition": "Retrieval-Augmented Generation - a technique that enhances AI responses by first retrieving relevant information from a knowledge base, then using that information to generate more accurate and contextual outputs.",
    "category": "AI & Models",
    "relatedTerms": ["knowledge-base", "embedding", "context"],
    "example": "Using RAG to answer support questions by retrieving relevant help articles before generating a response."
  },
  {
    "id": "embedding",
    "term": "Embedding",
    "definition": "A numerical representation of text that captures its semantic meaning. Embeddings enable similarity search and are fundamental to knowledge base retrieval in RAG systems.",
    "category": "AI & Models",
    "relatedTerms": ["rag", "knowledge-base", "vector"],
    "example": "Converting product descriptions into embeddings to enable semantic search functionality."
  },
  {
    "id": "tool",
    "term": "Tool",
    "definition": "A capability that agents can use to perform specific tasks like searching the web, running code, or accessing databases. Tools extend what AI agents can accomplish.",
    "category": "Core Concepts",
    "relatedTerms": ["agent", "action", "function-calling"],
    "example": "A web search tool that an agent uses to find current information about a topic."
  },
  {
    "id": "function-calling",
    "term": "Function Calling",
    "definition": "The ability of AI models to recognize when to use external tools or functions and format the appropriate calls. This enables structured interactions between AI and external systems.",
    "category": "AI & Models",
    "relatedTerms": ["tool", "agent", "api"],
    "example": "The AI deciding to call a weather API function when asked about current weather conditions."
  },
  {
    "id": "batch-processing",
    "term": "Batch Processing",
    "definition": "Running a workflow multiple times with different inputs, typically to process large datasets efficiently. Batch processing enables scaling AI operations across many items.",
    "category": "Workflows & Actions",
    "relatedTerms": ["workflow", "input", "loop"],
    "example": "Processing 1000 product listings through a description enhancement workflow overnight."
  },
  {
    "id": "mcp",
    "term": "MCP",
    "definition": "Model Context Protocol - an open standard that enables AI models to securely connect to external data sources and tools. MCP provides a universal way for AI applications to access context from various systems like databases, APIs, and file systems.",
    "category": "Integrations",
    "relatedTerms": ["integration", "tool", "context", "api"],
    "example": "Using MCP to connect an AI agent to Slack, allowing it to read messages and respond in channels."
  }
]
